// Массив с сообщениями для комментариев
export const MESSAGES = [
  "Всё отлично!",
  "В целом всё неплохо. Но не всё.",
  "Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.",
  "Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.",
  "Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.",
  "Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!"
];

// Массив c описаниями фотографии
export const DESCRIPTIONS = [
  "Фото сделано в самом центре города, когда солнце только начало садиться.",
  "Прекрасный момент, пойманный на природе, с солнечными лучами, пробивающимися через деревья.",
  "Эта фотография была сделана во время путешествия по горам. Вечер, туман и немного мистики.",
  "Отличный кадр с друзьями на празднике! Эмоции переполняют.",
  "Удивительный вид на город с высоты птичьего полета. Горы, дома и небо в одном кадре.",
  "Момент из отпуска, когда мы катались на лодке по реке. Спокойствие и умиротворение.",
];

// Массив с именами пользователей
export const NAMES = [
  "Артём", "Мария", "Иван", "Светлана", "Никита", "Елена", "Дмитрий", "Ольга", "Максим", "Александра"
];

// Максимальная длина комментария
export const MAX_COMMENT_LENGTH = 140;

// Максимальное количество хэш-тегов
export const MAX_HASHTAG_COUNT = 5;
